# FontHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..FontHeight Property
TextNode Class See Also
---
Height [ft] of the text font, in model space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double FontHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FontHeight As Double
	Get
```

Visual C++
---
```text
public:
property double FontHeight {
	double get ();
}
```

# Remarks
This is the height of the 'M' glyph in the text font.
# See Also
TextNode Class
Autodesk.Revit.DB Namespace